Revit 2027 API
StructuralElementDefinitionData.YOffset Property
 Y offset.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double YOffset { get; }
Public ReadOnly Property YOffset As Double
	Get
public:
property double YOffset {
	double get ();
}
member YOffset : float with get
Property Value
Double
See Also
Reference
StructuralElementDefinitionData Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace